XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>SAM4_DFP</name>
  <description>Microchip SAM4 Series Device Support and Examples</description>

  <releases>
    <release version="1.6.2" date="2023-09-04" deprecated="2023-09-04">
      This Software Pack is no longer maintained.
      Corrected device in board description attribute 'mountedDevice'.
      Updated Segger emWin to version 5.50.
    </release>
    <release version="1.6.1" date="2018-05-07">
      Updated device vendor from Atmel to Microchip.
      Updated emWin examples to emWin V5.46e.
      Updated Board Support LED_*.c files.
      Updated system file with corrected SystemCoreClock initial value to value set by SystemInit function
    </release>
    <release version="1.6.0" date="2017-02-06">
      Updated flash algorithms:
       - Added GPNVM Bytes templates (SAM4xGPNVM.s).
       - Added ATSAM4C_GPNVM.FLM.
       - Updated ATSAM4C_*.FLM.
      Updated SAM4C-EK examples
      Updated emWin examples to emWin V5.36f
      Updated system_SAM4S.c.
    </release>
    <release version="1.5.0" date="2016-07-12">
      emWin:
      - Updated emWin examples to emWin V5.32.
    </release>
    <release version="1.4.0" date="2015-08-28">
      Device Support:
      - Added SAM4CMS4C device support
      - Updated SAM4CM* device support
      - Reorganized SM4CM* folder structure
    </release>
    <release version="1.3.0" date="2015-06-22">
      Device Support:
      - Added SAM4C4C and SAM4CP16C
      - Updated SAM4C device support files and user manual.
      - Corrected ATSAM4C32_2048 Flash algorithm:
        -- set/clear GPNVM bits did not work as expected on this device.
      - Device feature descriptions corrected
      Board Support:
      - Added SAM4S-EK board support
      - Added SAM4S-EK, SAN4E-EK emWin examples.
      - Added emWin LCD Configuration file for FTM280C34D (8-bit Interface).
    </release>
    <release version="1.2.0" date="2014-12-05">
      Added ATSAM4S devices:
      - ATSAM4S2A, ATSAM4S2B, ATSAM4S2C,ATSAM4S4A, ATSAM4S4B, ATSAM4S4C
      Added Board Support bundles
      Corrected ATSAM4N, ATSAM4E flash algorithm
      Updated device support files
    </release>
    <release version="1.1.0" date="2014-09-18">
      Updated flash programming algorithms to use internal oscillator.
    </release>
    <release version="1.0.2" date="2014-03-12">
      New Devices: SAM4C32 and SAM4CM32 Series
    </release>
    <release version="1.0.1" date="2014-02-20">
      New Devices: SAM4CP and SAM4CM Series
      Updated: SAM4C Device Support files
    </release>
    <release version="1.0.0">
      First Release version of SAM4 Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Microchip</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Microchip</keyword>
    <keyword>SAM4</keyword>
  </keywords>

  <devices>
    <family Dfamily="SAM4 Series" Dvendor="Microchip:3">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>

      <feature type="TempSens"      n="1"/>
      <feature type="RTC"           n="1"       m="32768"/>

      <!-- ************************  Subfamily 'SAM4LC'  **************************** -->
      <subFamily DsubFamily="SAM4LC">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/Include/SAM4L/sam4l.h"/>
        <book name="Documents/Atmel-42023-ARM-Microcontroller-ATSAM4L-Low-Power-LCD_Datasheet.pdf" title="SAM4L Datasheet"/>
        <description>
The SAM4LC Cortex-M4 processor-based Flash microcontrollers offer the industry’s lowest power consumption
and fastest wake-up. The devices feature an LCD controller with up to 4x40 segments, an embedded capacitive
touch module supported by Microchip QTouch technology, USB host, and multiple serial communication interfaces.
They are ideal for a wide range of industrial, healthcare and consumer applications.
        </description>

        <feature type="USBD"          n="1"/>
        <feature type="Touch"         n="1"                           name="Hardware QTouch Acquisition"/>
        <feature type="SPI"           n="1"/>
        <feature type="DAC"           n="1"       m="10"/>
        <feature type="Crypto"        n="1"       m="128"/>

        <!-- *************************  Device 'ATSAM4LC2A'  ***************************** -->
        <device Dname="ATSAM4LC2A">
          <compile    define="__SAM4LC2A__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC2A.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>

          <feature type="IOs"           n="27"/>
          <feature type="ExtInt"        n="27"/>
          <feature type="Touch"         n="13"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="3"/>
          <feature type="LCD"           n="13"/>
          <feature type="ADC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC2B'  ***************************** -->
        <device Dname="ATSAM4LC2B">
          <compile    define="__SAM4LC2B__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC2B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>

