XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
        <!-- *************************  Device 'ATSAM4N16B'  ***************************** -->
        <device Dname="ATSAM4N16B">
          <compile    define="__SAM4N16B__"/>
          <debug      svd="SVD/SAM4N/ATSAM4N16B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4N_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="Other"         n="1"                           name="Quadrature Decoder Channels"/>
          <feature type="SPI"           n="3"/>
          <feature type="UART"          n="6"/>
          <feature type="ADC"           n="1"       m="10"/>
          <feature type="DAC"           n="1"       m="10"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4N16C'  ***************************** -->
        <device Dname="ATSAM4N16C">
          <compile    define="__SAM4N16C__"/>
          <debug      svd="SVD/SAM4N/ATSAM4N16C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4N_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="Other"         n="2"                           name="Quadrature Decoder Channels"/>
          <feature type="SPI"           n="4"/>
          <feature type="UART"          n="7"/>
          <feature type="ADC"           n="1"       m="10"/>
          <feature type="DAC"           n="1"       m="10"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4N8A'  ***************************** -->
        <device Dname="ATSAM4N8A">
          <compile    define="__SAM4N8A__"/>
          <debug      svd="SVD/SAM4N/ATSAM4N8A.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4N_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="34"/>
          <feature type="ExtInt"        n="34"/>
          <feature type="SPI"           n="2"/>
          <feature type="UART"          n="5"/>
          <feature type="ADC"           n="8"       m="10"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4N8B'  ***************************** -->
        <device Dname="ATSAM4N8B">
          <compile    define="__SAM4N8B__"/>
          <debug      svd="SVD/SAM4N/ATSAM4N8B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4N_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="Other"         n="1"                           name="Quadrature Decoder Channels"/>
          <feature type="SPI"           n="3"/>
          <feature type="UART"          n="6"/>
          <feature type="ADC"           n="1"       m="10"/>
          <feature type="DAC"           n="1"       m="10"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4N8C'  ***************************** -->
        <device Dname="ATSAM4N8C">
          <compile    define="__SAM4N8C__"/>
          <debug      svd="SVD/SAM4N/ATSAM4N8C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4N_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="Other"         n="2"                           name="Quadrature Decoder Channels"/>
          <feature type="SPI"           n="4"/>
          <feature type="UART"          n="7"/>
          <feature type="ADC"           n="1"       m="10"/>
          <feature type="DAC"           n="1"       m="10"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'SAM4S'  **************************** -->
      <subFamily DsubFamily="SAM4S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/SAM4S/sam4s.h"/>
        <book name="Documents/Atmel-11100-32-bit-Cortex-M4-Microcontroller_Datasheet.pdf" title="SAM4S Datasheet"/>
        <description>
Based on the powerful ARM Cortex-M4 core, the Micochip SAM4S series extends the Microchip Cortex-M portfolio to offer:
 - Increased performance and power efficiency
 - Higher memory densities: up to 2MB of Flash and 160KB of SRAM
 - And a rich peripheral set for connectivity, system control and analog interfacing.
        </description>

