XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S8B'  ***************************** -->
        <device Dname="ATSAM4S8B">
          <compile    define="__SAM4S8B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S8B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S8C'  ***************************** -->
        <device Dname="ATSAM4S8C">
          <compile    define="__SAM4S8C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S8C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4SA16B'  ***************************** -->
        <device Dname="ATSAM4SA16B">
          <compile    define="__SAM4SA16B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4SA16B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00480000"  size="0x80000"    startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4SA16C'  ***************************** -->
        <device Dname="ATSAM4SA16C">
          <compile    define="__SAM4SA16C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4SA16C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00480000"  size="0x80000"    startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4SD16B'  ***************************** -->
        <device Dname="ATSAM4SD16B">
          <compile    define="__SAM4SD16B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4SD16B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00480000"  size="0x80000"    startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4SD_1024.FLM"  start="0x00400000"  size="0x100000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4SD16C'  ***************************** -->
        <device Dname="ATSAM4SD16C">
          <compile    define="__SAM4SD16C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4SD16C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00480000"  size="0x80000"    startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4SD_1024.FLM"  start="0x00400000"  size="0x100000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

