XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
        <!-- *************************  Device 'ATSAM4E16C'  ***************************** -->
        <device Dname="ATSAM4E16C">
          <compile    define="__SAM4E16C__"/>
          <debug      svd="SVD/SAM4E/ATSAM4E16C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4E_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="CAN"           n="1"/>
          <feature type="ADC"           n="10"      m="16"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4E16E'  ***************************** -->
        <device Dname="ATSAM4E16E">
          <compile    define="__SAM4E16E__"/>
          <debug      svd="SVD/SAM4E/ATSAM4E16E.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4E_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>

          <feature type="IOs"           n="117"/>
          <feature type="ExtInt"        n="117"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="24"      m="16"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="Timer"         n="9"/>
          <feature type="TimerOther"    n="24"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="18"                          name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4E8C'  ***************************** -->
        <device Dname="ATSAM4E8C">
          <compile    define="__SAM4E8C__"/>
          <debug      svd="SVD/SAM4E/ATSAM4E8C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4E_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="CAN"           n="1"/>
          <feature type="ADC"           n="10"      m="16"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4E8E'  ***************************** -->
        <device Dname="ATSAM4E8E">
          <compile    define="__SAM4E8E__"/>
          <debug      svd="SVD/SAM4E/ATSAM4E8E.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4E_512.FLM"    start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="117"/>
          <feature type="ExtInt"        n="117"/>
          <feature type="CAN"           n="2"/>
          <feature type="ADC"           n="24"      m="16"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="Timer"         n="9"/>
          <feature type="TimerOther"    n="24"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="18"                          name="Input Capture Channels"/>
        </device>
      </subFamily>
    </family>

    <family Dfamily="SAM4 Dualcore Series" Dvendor="Microchip:3">
      <processor Pname="CM4_P0" Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <processor Pname="CM4_P1" Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>

      <!-- ******************************  SAM4C  ****************************** -->
      <subFamily DsubFamily="SAM4C">
        <processor Pname="CM4_P0" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <processor Pname="CM4_P1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile   header="Device/Include/SAM4C/sam4c.h"/>
        <book name="Documents/Atmel-11102-32-bit-Cortex-M4-Microcontroller-SAM4C32-SAM4C16-SAM4C8-SAM4C4_Datasheet.pdf" title="SAM4C Datasheet"/>
        <description>
Symmetrical/Asynchronous Dual Core Architecture
  - Interrupt-based Interprocessor Communication
  - Cryptography
  - Physical Anti-tamper Detection I/O
  - Security bit for Device Protection
  - Segmented LCD Controller
  - SW Controlled On-Chip Reference ranging from 1.6V to 3.4V
  - Temperature Sensor and Backup Battery Voltage Measurement Channel
        </description>

        <!-- ******************************  SAM4C4C  ****************************** -->
        <device Dname="ATSAM4C4C">
          <compile   Pname="CM4_P0" define="__SAM4C4C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4C4C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4C/ATSAM4C4C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4C/ATSAM4C4C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x40000"    startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_256.FLM"    start="0x01000000"  size="0x40000"                  default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>
        </device>

        <!-- ******************************  SAM4C8C  ****************************** -->
        <device Dname="ATSAM4C8C">
          <compile   Pname="CM4_P0" define="__SAM4C8C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4C8C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4C/ATSAM4C8C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4C/ATSAM4C8C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x80000"    startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_512.FLM"    start="0x01000000"  size="0x80000"                  default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>
        </device>

        <!-- ******************************  SAM4C16C  ****************************** -->
        <device Dname="ATSAM4C16C">
          <compile   Pname="CM4_P0" define="__SAM4C16C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4C16C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4C/ATSAM4C16C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4C/ATSAM4C16C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_1024.FLM"   start="0x01000000"  size="0x100000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>
        </device>
      </subFamily>

      <!-- ******************************  SAM4C32  **************************** -->
      <subFamily DsubFamily="SAM4C32">
        <processor Pname="CM4_P0" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <processor Pname="CM4_P1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile   header="Device/Include/SAM4C32/sam4c32.h"/>
        <book name="Documents/Atmel-11102-32-bit-Cortex-M4-Microcontroller-SAM4C32-SAM4C16-SAM4C8-SAM4C4_Datasheet.pdf" title="SAM4C Datasheet"/>
        <description>
Symmetrical/Asynchronous Dual Core Architecture
  - Interrupt-based Interprocessor Communication
  - Cryptography
  - Physical Anti-tamper Detection I/O
  - Security bit for Device Protection
  - Segmented LCD Controller
  - SW Controlled On-Chip Reference ranging from 1.6V to 3.4V
  - Temperature Sensor and Backup Battery Voltage Measurement Channel
        </description>

        <feature type="ExtBus"        n="16"                     name="External Bus Interface"/>
        <feature type="UART"          n="2"                      name="UART Interface"/>
        <feature type="USART"         n="5"                      name="USART Interface"/>
        <feature type="SPI"           n="7"                      name="SPI Interface"/>
        <feature type="ComOther"      n="2"                      name="TWI Two-wire Interface"/>
        <feature type="ADC"           n="8"       m="10"         name="ADC"/>
        <feature type="Timer"         n="6"       m="16"         name="Timer"/>
        <feature type="PWM"           n="4"       m="16"         name="Pulse Width Modulation"/>
        <feature type="WDT"           n="1"/>
        <feature type="Crypto"        n="1"       m="128"        name="AES, CPKCC, ICM (SHA), TRNG"/>
        <feature type="LCD"           n="1"       m="50.6"       name="Segment LCD Controller"/>

        <!-- ******************************  SAM4C32C  **************************** -->
        <device Dname="ATSAM4C32C">
          <compile   Pname="CM4_P0" define="__SAM4C32C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4C32C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4C32/ATSAM4C32C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4C32/ATSAM4C32C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IROM2"                      start="0x01100000"  size="0x100000"   startup="0"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x40000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C32_2048.FLM" start="0x01000000"  size="0x200000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->

          <feature type="IOs"           n="74"                     name="General Purpose I/Os"/>
          <feature type="QFP"           n="100"                    name="LQFP Package"/>
        </device>

        <!-- ******************************  SAM4C32E  **************************** -->
        <device Dname="ATSAM4C32E">
          <compile   Pname="CM4_P0" define="__SAM4C32E_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4C32E_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4C32/ATSAM4C32E_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4C32/ATSAM4C32E_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IROM2"                      start="0x01100000"  size="0x100000"   startup="0"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x40000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C32_2048.FLM" start="0x01000000"  size="0x200000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->

          <feature type="IOs"           n="106"                    name="General Purpose I/Os"/>
          <feature type="USBD"          n="1"                      name="USB Device"/>
          <feature type="USBH"          n="1"                      name="USB Host"/>
          <feature type="QFP"           n="144"                    name="LQFP Package"/>
        </device>
      </subFamily>

      <!-- ******************************  SAM4CM  ****************************** -->
      <subFamily DsubFamily="SAM4CM">
        <processor Pname="CM4_P0" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <processor Pname="CM4_P1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile   header="Device/SAM4CM/Include/sam4cm.h"/>
        <book name="Documents/Atmel-11203-32-bit-Cortex-M4-Microcontroller-SAM4CM32-SAM4CM16-SAM4CM8-SAM4CM4.pdf" title="SAM4CM Datasheet"/>
        <description>
Symmetrical/Asynchronous Dual Core Architecture
  - Interrupt-based Interprocessor Communication
  - Cryptography
  - Physical Anti-tamper Detection I/O
  - Security bit for Device Protection
  - Segmented LCD Controller
  - Two-phase (SAM4CMS) or three-phase (SAM4CMP) Energy Metering Analog-Front-End
  - SW Controlled On-Chip Reference ranging from 1.6V to 3.4V
  - Temperature Sensor and Backup Battery Voltage Measurement Channel
        </description>

        <!-- ******************************  SAM4CMP8C  ****************************** -->
        <device Dname="ATSAM4CMP8C">
          <compile   Pname="CM4_P0" define="__SAM4CMP8C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMP8C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM/ATSAM4CMP8C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM/ATSAM4CMP8C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x80000"    startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_512.FLM"    start="0x01000000"  size="0x80000"                  default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
        </device>

        <!-- ******************************  SAM4CMP16C  ****************************** -->
        <device Dname="ATSAM4CMP16C">
          <compile   Pname="CM4_P0" define="__SAM4CMP16C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMP16C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM/ATSAM4CMP16C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM/ATSAM4CMP16C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_1024.FLM"   start="0x01000000"  size="0x100000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
        </device>

        <!-- ******************************  SAM4CMS4C  ****************************** -->
        <device Dname="ATSAM4CMS4C">
          <compile   Pname="CM4_P0" define="__SAM4CMS4C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMS4C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM/ATSAM4CMS4C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM/ATSAM4CMS4C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x40000"    startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_256.FLM"    start="0x01000000"  size="0x40000"                  default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
        </device>

