XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
    <condition id="SAM4SP CMSIS">
      <description>Microchip SAM4SP Devices and CMSIS-CORE</description>
      <require condition="SAM4SP"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4C CMSIS">
      <description>Microchip SAM4C Devices and CMSIS-CORE</description>
      <require condition="SAM4C"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4C32 CMSIS">
      <description>Microchip SAM4C32 Devices and CMSIS-CORE</description>
      <require condition="SAM4C32"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4CM CMSIS">
      <description>Microchip SAM4CM Devices and CMSIS-CORE</description>
      <require condition="SAM4CM"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4CM32 CMSIS">
      <description>Microchip SAM4CM32 Devices and CMSIS-CORE</description>
      <require condition="SAM4CM32"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4CP CMSIS">
      <description>Microchip SAM4CP Devices and CMSIS-CORE</description>
      <require condition="SAM4CP"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="Graphics Core and LCD 8-bit IF">
      <description>Graphics CORE component and LCD driver (8-bit Interface)</description>
      <accept condition="SAM4E CMSIS"/>             <!-- display mounted on SAM4E-EK -->
      <accept condition="SAM4S CMSIS"/>             <!-- display mounted on SAM4S-EK -->
      <require Cclass="Graphics" Cgroup="CORE"/>
      <require Cclass="Board Support" Cgroup="emWin LCD" Cvariant="8-bit IF"/>
    </condition>

    <condition id="SAM4E CMSIS and LCD_8-bit">
      <description>Microchip SAM4E Devices and CMSIS-CORE and LCD (8-bit IF)</description>
      <require condition="SAM4E CMSIS"/>
      <require Cclass="Graphics" Cgroup="CORE"/>
      <require Cclass="Graphics Display" Cgroup="FTM280C34D" Cvariant="8-bit IF"/>
    </condition>

    <condition id="SAM4S CMSIS and LCD_8-bit">
      <description>Microchip SAM4S Devices and CMSIS-CORE and LCD (8-bit IF)</description>
      <require condition="SAM4S CMSIS"/>
      <require Cclass="Graphics" Cgroup="CORE"/>
      <require Cclass="Graphics Display" Cgroup="FTM280C34D" Cvariant="8-bit IF"/>
    </condition>

  </conditions>

  <components>
    <!-- Startup SAM4E -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.2" condition="SAM4E CMSIS">
      <description>System Startup for Microchip SAM4E Devices</description>
      <files>
        <file category="include" name="Device/Include/SAM4E/"/>
        <file category="source"  name="Device/Source/ARM/startup_SAM4E.s"    attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SAM4E.c"         attr="config" version="1.0.2"/>
      </files>
    </component>

    <!-- Startup SAM4L -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="SAM4L CMSIS">
      <description>System Startup for Microchip SAM4L Devices</description>
      <files>
        <file category="include" name="Device/Include/SAM4L/"/>
        <file category="source"  name="Device/Source/ARM/startup_sam4l.s"    attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_sam4l.c"         attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Startup SAM4N -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.2" condition="SAM4N CMSIS">
      <description>System Startup for Microchip SAM4N Devices</description>
      <files>
        <file category="include" name="Device/Include/SAM4N/"/>
        <file category="source"  name="Device/Source/ARM/startup_SAM4N.s"    attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SAM4N.c"         attr="config" version="1.0.2"/>
      </files>
    </component>

    <!-- Startup SAM4S -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.2" condition="SAM4S CMSIS">
      <description>System Startup for Microchip SAM4S Devices</description>
      <files>
        <!-- GPNVM Bytes templates -->
        <file category="source" name="Device/Source/ARM/SAM4xGPNVM.s"        attr="template"               condition="Compiler ARMCC" select="GPNVM Bytes Template"/>

        <file category="include" name="Device/Include/SAM4S/"/>
        <file category="source"  name="Device/Source/ARM/startup_SAM4S.s"    attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SAM4S.c"         attr="config" version="1.1.2"/>
      </files>
    </component>

    <!-- Startup SAM4SP -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="SAM4SP CMSIS">
      <description>System Startup for Microchip SAM4SP Devices</description>
      <files>
        <file category="include" name="Device/Include/SAM4SP/"/>
        <file category="source"  name="Device/Source/ARM/startup_sam4sp.s"   attr="config" version="1.1.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_sam4sp.c"        attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Startup SAM4C -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="SAM4C CMSIS">
      <description>System Startup for Microchip SAM4C Devices</description>
      <files>
        <!-- GPNVM Bytes templates -->
        <file category="source" name="Device/Source/ARM/SAM4xGPNVM.s"        attr="template"               condition="Compiler ARMCC" select="GPNVM Bytes Template"/>

        <file category="include" name="Device/Include/SAM4C/"/>
        <file category="source"  name="Device/Source/ARM/startup_SAM4C.s"    attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SAM4C.c"         attr="config" version="1.0.2"/>
      </files>
    </component>

