XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
    <!-- Startup SAM4C32 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="SAM4C32 CMSIS">
      <description>System Startup for Microchip SAM4C32 Devices</description>
      <files>
        <file category="include" name="Device/Include/SAM4C32/"/>
        <file category="source"  name="Device/Source/ARM/startup_SAM4C32.s"  attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_sam4c32.c"       attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Startup SAM4CM -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.2" condition="SAM4CM CMSIS">
      <description>System Startup for Microchip SAM4CM Devices</description>
      <files>
        <file category="include" name="Device/SAM4CM/Include/"/>
        <file category="source"  name="Device/SAM4CM/Source/ARM/startup_SAM4CM.s"   attr="config" version="1.0.2" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/SAM4CM/Source/system_sam4cm.c"        attr="config" version="1.0.2"/>
      </files>
    </component>

    <!-- Startup SAM4CM32 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="SAM4CM32 CMSIS">
      <description>System Startup for Microchip SAM4CM32 Devices</description>
      <files>
        <file category="include" name="Device/SAM4CM32/Include/"/>
        <file category="source"  name="Device/SAM4CM32/Source/ARM/startup_SAM4CM32.s" attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/SAM4CM32/Source/system_sam4cm32.c"      attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- Startup SAM4CP -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="SAM4CP CMSIS">
      <description>System Startup for Microchip SAM4CP Devices</description>
      <files>
        <file category="include" name="Device/Include/SAM4CP/"/>
        <file category="source"  name="Device/Source/ARM/startup_SAM4CP.s"   attr="config" version="1.0.1" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_sam4cp.c"        attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- emWin Graphics Library -->
    <component Cclass="Graphics Display" Cgroup="FTM280C34D" Cvariant="8-bit IF" Cversion="1.0.0" condition="Graphics Core and LCD 8-bit IF">
      <description>LCD Configuration for FTM280C34D (8-bit Interface)</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Graphics_LCD_FTM280C34D_8  /* Graphics LCD SAM4E-EK 8-bit IF */
      </RTE_Components_h>
      <files>
        <file category="source" name="Boards/Atmel/Display/LCDConf_FTM280C34D.c" attr="config" version="1.0.1"/>
      </files>
    </component>

    <!-- SAM4C-EK Board Support -->
    <bundle Cbundle="SAM4C-EK" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAM4C-EK Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAM4C CMSIS">
      <description>LED driver for Microchip SAM4C-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4C-EK/Common/LED_SAM4C-EK.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAM4C CMSIS">
      <description>Button driver for Microchip SAM4C-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4C-EK/Common/Buttons_SAM4C-EK.c"/>
        </files>
      </component>
    </bundle>

    <!-- SAM4E-EK Board Support -->
    <bundle Cbundle="SAM4E-EK" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAM44-EK Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAM4E CMSIS">
      <description>LED driver for Microchip SAM4E-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4E-EK/Common/LED_SAM4E-EK.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAM4E CMSIS">
      <description>Button driver for Microchip SAM4E-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4E-EK/Common/Buttons_SAM4E-EK.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="SAM4E CMSIS">
        <description>Graphic LCD driver for Microchip SAM4E-EK Board</description>
        <files>
          <file category="header"  name="Boards/Atmel/SAM4E-EK/Common/GLCD_Config.h"/>
          <file category="source"  name="Boards/Atmel/SAM4E-EK/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Atmel/SAM4E-EK/Common/GLCD_SAM4E-EK.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="SAM4E CMSIS">
        <description>Touchscreen Interface for ADS7843</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4E-EK/Common/Touch_ADS7843.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="8-bit IF" condition="SAM4E CMSIS and LCD_8-bit">
        <description>emWin LCD 8-bit Interface for Microchip SAM4E-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4E-EK/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <!-- SAM4S-EK Board Support -->
    <bundle Cbundle="SAM4S-EK" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAM4S-EK Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAM4S CMSIS">
      <description>LED driver for Microchip SAM4S-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4S-EK/Common/LED_SAM4S-EK.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAM4S CMSIS">
      <description>Button driver for Microchip SAM4S-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4S-EK/Common/Buttons_SAM4S-EK.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="SAM4S CMSIS">
        <description>Graphic LCD driver for Microchip SAM4S-EK Board</description>
        <files>
          <file category="header"  name="Boards/Atmel/SAM4S-EK/Common/GLCD_Config.h"/>
          <file category="source"  name="Boards/Atmel/SAM4S-EK/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Atmel/SAM4S-EK/Common/GLCD_SAM4S-EK.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="SAM4S CMSIS">
        <description>Touchscreen Interface for ADS7843</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4S-EK/Common/Touch_ADS7843.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="8-bit IF" condition="SAM4S CMSIS and LCD_8-bit">
        <description>emWin LCD 8-bit Interface for Microchip SAM4S-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4S-EK/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>

    <!-- SAM4L-EK Board Support -->
    <bundle Cbundle="SAM4L-EK" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAM4L-EK Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAM4L CMSIS">
      <description>LED driver for Microchip SAM4L-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4L-EK/Common/LED_SAM4L-EK.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAM4L CMSIS">
      <description>Button driver for Microchip SAM4L-EK Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4L-EK/Common/Buttons_SAM4L-EK.c"/>
        </files>
      </component>
    </bundle>

    <!-- SAM4L-XPRO Board Support -->
    <bundle Cbundle="SAM4L-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAM4L-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAM4L CMSIS">
      <description>LED driver for Microchip SAM4L-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4L-XPRO/Common/LED_SAM4L-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAM4L CMSIS">
      <description>Button driver for Microchip SAM4L-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4L-XPRO/Common/Buttons_SAM4L-XPRO.c"/>
        </files>
      </component>
    </bundle>

    <!-- SAM4S-XPRO Board Support -->
    <bundle Cbundle="SAM4S-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAM4S-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="SAM4S CMSIS">
      <description>LED driver for Microchip SAM4S-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4S-XPRO/Common/LED_SAM4S-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="SAM4S CMSIS">
      <description>Button driver for Microchip SAM4S-XPRO Board</description>
        <files>
          <file category="source" name="Boards/Atmel/SAM4S-XPRO/Common/Buttons_SAM4S-XPRO.c"/>
        </files>
      </component>
    </bundle>

  </components>

