XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM4_DFP.pdsc
  <boards>
    <board vendor="Atmel" name="SAM4C-EK"   revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>Microchip SAM4C-EK Evaluation Kit (ATSAM4C-EK)</description>
      <book category="overview"  name="http://www.atmel.com/tools/SAM4C-EK.aspx"  title="SAM4C-EK Evaluation Kit for the Atmel SAM4C"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAM4C16C"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM4C"/>
    </board>

    <board vendor="Atmel" name="SAM4E-EK"   revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.Microchip.com/">
      <description>Microchip SAM4E-EK (ATSAM4E-EK)</description>
      <book category="overview"  name="http://www.atmel.com/tools/sam4e-ek.aspx"  title="SAM4E-EK Evaluation Kit for the Atmel SAM4E"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAM4E16C"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM4E"/>
    </board>

    <board vendor="Atmel" name="SAM4S-EK"   revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>Microchip SAM4S-EK (ATSAM4S-EK)</description>
      <book category="overview"  name="http://www.atmel.com/tools/sam4s-ek.aspx"  title="SAM4S-EK Evaluation Kit for the Atmel SAM4E"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAM4S16C"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM4S"/>
    </board>

    <board vendor="Atmel" name="SAM4L-EK"   revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>Microchip SAM4L-EK (ATSAM4L-EK)</description>
      <book category="overview"  name="http://www.atmel.com/tools/sam4l-ek.aspx"  title="SAM4L-EK Evaluation Kit for the Atmel SAM4L"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAM4LC4C"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM4L"/>
    </board>

    <board vendor="Atmel" name="SAM4L-XPRO" revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>Microchip SAM4L Xplained Pro Evaluation Kit (ATSAM4L-XPRO)</description>
      <book category="overview"  name="http://www.atmel.com/tools/atsam4l-xpro.aspx"  title="SAM4L Xplained Pro Evaluation Kit"/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAM4LC4C"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM4L"/>
    </board>

    <board vendor="Atmel" name="SAM4S-XPRO" revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>Microchip SAM4S Xplained Pro Evaluation Kit (ATSAM4S-XPRO)</description>
      <book category="overview"  name="http://www.atmel.com/tools/atsam4s-xpro.aspx"  title="SAM4S Xplained Pro Evaluation Kit "/>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAM4SD32C"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM4S"/>
    </board>
  </boards>

  <examples>
    <!-- SAM4C-EK Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAM4C-EK/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAM4C-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS RTX_Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAM4C-EK/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAM4C-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="DualCore Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAM4C-EK/DualCore">
      <description>DualCore based Blinky example</description>
      <board name="SAM4C-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="DualCore.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- SAM4E-EK Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAM4E-EK/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAM4E-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS RTX_Blinky" doc="Abstract.txt" folder="Boards/Atmel/SAM4E-EK/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAM4E-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="emWin Example" doc="Abstract.txt" folder="Boards/Atmel/SAM4E-EK/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="SAM4E-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>
    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards/Atmel/SAM4E-EK/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="SAM4E-EK" vendor="Atmel"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

